# abs()  # 对传入的参数取绝对值
# bool()  # 将传入的参数转换为布尔值
# all()  # 判断传入的可迭代对象中的所有元素是否都为True
# any()  # 判断传入的可迭代对象中是否有任意一个元素为True
# ascii()  # 返回一个对象的ASCII表示,自动执行传入的对象的__repr__()方法(将对象转换为字符串)
# bin()  # 返回一个整数的二进制表示
# oct()  # 返回一个整数的八进制表示
# hex()  # 返回一个整数的十六进制表示
# bytes()  # 返回一个新的bytes对象
# str()  # 返回一个字符串对象
# chr(65)  # 数字转字符
# ord('A')  # 字符转数字
# compile()  # 接收 .py 文件或字符串,将其编译为字节码
# eval()  # 执行python代码,返回执行结果
# exec()  # 执行python代码,无返回值
# dir()  # 返回一个对象的所有属性和方法
# help()  # 返回一个对象的帮助文档
# divmod(100,10)  # 返回一个元组,包含两个整数,第一个整数是第一个参数除以第二个参数的商,第二个整数是第一个参数除以第二个参数的余数
# enumerate()  # 接收序列化类型的数据,返回一个迭代器
# isinstance()  # 判断一个对象是否是一个类的实例
# filter()  # 过滤器,接收一个函数和一个可迭代对象,返回一个迭代器
# map()  # 映射,接收一个函数和一个可迭代对象,返回一个迭代器
# format()  # 格式化输出
# frozenset()  # 转变为不可变集合
# globals()  # 返回一个字典,包括所有全局变量与他的值所组成的键值对
# locals()  # 返回一个字典,包括所有局部变量与他的值所组成的键值对
# hash()  # 返回一个对象的哈希值
# id()  # 返回一个对象的内存地址
# input('please input:')  # 接收用户输入
# issubclass(subclass,class)  # 判断一个类是否是另一个类的派生类
# len()  # 返回一个对象的长度
# max()  # 返回一个可迭代对象中的最大值
# min()  # 返回一个可迭代对象中的最小值
# memoryview()  #  查看一个对象的内存地址
# # next()  # 返回一个迭代器的下一个元素
# iter()  # 返回一个迭代器
# object()  # 返回一个空对象
# pow(x,y)  # 返回一个数的幂
# pow(x,y,z)  # 返回一个数的幂,第三个参数是取模的值
# property()  # 返回一个属性
# range()  # 获取随机数或随机字符
# repr()  # 执行传入对象的__repr__()方法
# reversed()  # 返回一个反向迭代器
# sorted()  # 返回一个排序后的列表
# slice()  # 返回一个切片对象
round()  # 返回一个浮点数的四舍五入值
int()  # 返回一个整数
list()  # 返回一个列表
tuple()  # 返回一个元组
set()  # 返回一个集合
str()  # 返回一个字符串
type()  # 返回一个对象的类型
staticmethod()  # 返回一个静态方法
super()  # 返回基类
vars()  # 返回当前模块的所有变量
zip()  # 接收多个序列化类型的数据,对各序列化数据的元素,按索引位置分类成一个元组
